acore_soap_app/agent/execute-command.xml

<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/1999/XMLSchema"
    xmlns:ns1="urn:AC">
    <SOAP-ENV:Body>
    <ns1:executeCommand>
        <command>{command}</command>
    </ns1:executeCommand>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>